In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
edu=pd.read_csv('educ_figdp_1_Data.csv', na_values=':', usecols=["TIME", "GEO","Value"])
edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [3]:
edu.head(10)

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95
5  2005  European Union (28 countries)   4.92
6  2006  European Union (28 countries)   4.91
7  2007  European Union (28 countries)   4.92
8  2008  European Union (28 countries)   5.04
9  2009  European Union (28 countries)   5.38

In [4]:
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [5]:
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [6]:
edu.tail(10)

     TIME      GEO  Value
374  2002  Finland   6.22
375  2003  Finland   6.43
376  2004  Finland   6.42
377  2005  Finland   6.30
378  2006  Finland   6.18
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [7]:
edu["TIME"]

0      2000
1      2001
2      2002
3      2003
4      2004
       ...
379    2007
380    2008
381    2009
382    2010
383    2011
Name: TIME, Length: 384, dtype: int64

In [8]:
result=edu["TIME"]
result

0      2000
1      2001
2      2002
3      2003
4      2004
       ...
379    2007
380    2008
381    2009
382    2010
383    2011
Name: TIME, Length: 384, dtype: int64

In [9]:
res=edu[["TIME","GEO","Value"]]
res

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [10]:
edu['Value']

0       NaN
1       NaN
2      5.00
3      5.03
4      4.95
       ...
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value, Length: 384, dtype: float64

In [11]:
edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

In [12]:
edu[10:14]

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99

In [13]:
edu.ix[90:94,['TIME','GEO']]

AttributeError: 'DataFrame' object has no attribute 'ix'

In [14]:
#Another way to select subset of data is by applying boolean indexing. Boolean indexing is commonly known as filter.
'''
count()-Number of non-null observation
sum()-sum of values
mean()-mean of values
median()-arithmetic median of values
min()-minimum
max()-maximum
prod()-product of values
std()-unbiased standard deviation
var()-unbiased variance
'''

'\ncount()-Number of non-null observation\nsum()-sum of values\nmean()-mean of values\nmedian()-arithmetic median of values\nmin()-minimum\nmax()-maximum\nprod()-product of values\nstd()-unbiased standard deviation\nvar()-unbiased variance\n'

In [15]:
edu[edu['Value']>6.5].tail()

     TIME      GEO  Value
286  2010    Malta   6.74
287  2011    Malta   7.96
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [16]:
edu[edu["Value"].isnull()].head()

    TIME                            GEO  Value
0   2000  European Union (28 countries)    NaN
1   2001  European Union (28 countries)    NaN
36  2000       Euro area (18 countries)    NaN
37  2001       Euro area (18 countries)    NaN
48  2000       Euro area (17 countries)    NaN

In [17]:
edu.max(axis=0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object

In [18]:
print("Pandas max function:", edu['Value'].max())
print("Pandas max function:", max(edu['Value']))

Pandas max function: 8.81
Pandas max function: nan

In [19]:
s=edu["Value"]/100
s.head()

0       NaN
1       NaN
2    0.0500
3    0.0503
4    0.0495
Name: Value, dtype: float64

In [20]:
s=edu["Value"].apply(np.sqrt)
s.head()

0         NaN
1         NaN
2    2.236068
3    2.242766
4    2.224860
Name: Value, dtype: float64

In [21]:
edu.max(axis=0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object

In [22]:
edu["Value"].apply(lambda d: d**2).head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [23]:
s=edu["Value"].apply(lambda d: d**2)
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [24]:
edu['ValueNorm']=edu['Value']/edu['Value'].max()
edu.tail()

     TIME      GEO  Value  ValueNorm
379  2007  Finland   5.90   0.669694
380  2008  Finland   6.10   0.692395
381  2009  Finland   6.81   0.772985
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310

In [25]:
edu.drop('ValueNorm',axis=1,inplace=True)
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [27]:
edu=edu.concat({"TIME":2000,"Value":5.00,"GEO":'a'}, ignore_index=True)
edu.tail()

AttributeError: 'DataFrame' object has no attribute 'concat'